# THIS FILE IS AUTOMATICALLY GENERATED
# Project: E:\Psoc\Comprehensive_Experiment\Fridge\Fridge.cydsn\Fridge.cyprj
# Date: Mon, 16 Jul 2018 02:32:22 GMT
#set_units -time ns
create_clock -name {ADC_Ext_CP_Clk(routed)} -period 15.625 -waveform {0 7.8125} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 15.625 -waveform {0 7.8125} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 15.625 -waveform {0 7.8125} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_clock -name {ADC_Ext_CP_Clk} -period 15.625 -waveform {0 7.8125} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 129 257} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {ADC_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 349 697} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_clock -name {ADC_theACLK(fixed-function)} -period 5437.5 -waveform {0 2718.75} [get_pins {ClockBlock/aclk_glb_ff_0}]
create_generated_clock -name {clock_4} -source [get_pins {ClockBlock/clk_sync}] -edges {1 833 1667} [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {clock_2} -source [get_pins {ClockBlock/clk_sync}] -edges {1 6401 12801} [list [get_pins {ClockBlock/dclk_glb_4}]]
create_generated_clock -name {CapSense_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 7 11} -nominal_period 83.333333333333329 [list [get_pins {ClockBlock/dclk_glb_1}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for E:\Psoc\Comprehensive_Experiment\Fridge\Fridge.cydsn\TopDesign\TopDesign.cysch
# Project: E:\Psoc\Comprehensive_Experiment\Fridge\Fridge.cydsn\Fridge.cyprj
# Date: Mon, 16 Jul 2018 02:31:58 GMT
